#include <iostream>
using namespace std;

/*
猴子和香蕉
在一个动物园里，科学家们设计了一个实验来测试猴子的 IQ：把香蕉挂在很高的地方，
猴子可以利用一些箱子搭成一个塔，每个箱子有三个参数(xi, yi 和 zi.)，表示箱子的三维。由
于箱子可以翻转，箱子 i 可以放在箱子 j 上面的充要条件是对于它们的接触面，箱子 i 的长
和宽都必须严格小于箱子 j 的长和宽。
现在你的任务是计算对于给定的箱子种类集合，所能搭到的最大高度是多少，每种箱
子都有无限多个。
输入格式：
输入数据包含多个测试，每个测试的第一行给出了箱子的种数 n(n<=30)，n=0 时结束，
接下来的 n 行给出了每种箱子的三维。
输出格式：
对于每一个测试，输出可以搭成塔的最大高度。
输入样例：
1 
10 20 30 
2 
6 8 10 
5 5 5 
7 
1 1 1 
2 2 2 
3 3 3 
4 4 4 
5 5 5 
6 6 6 
7 7 7 
5 
31 41 59 
26 53 58 
97 93 23 
84 62 64 
33 83 27 
0 
输出样例：
Case 1: maximum height = 40 
Case 2: maximum height = 21 
Case 3: maximum height = 28 
Case 4: maximum height = 342
*/

int main(void){
    return 0;
}